---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData.FlowConversionMode
source: html/e1aabc6f-cf9a-0317-d4ef-517f561c87e1.htm
---
# Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData.FlowConversionMode Property

The flow conversion mode of the pipe.

## Syntax (C#)
```csharp
public FlowConversionMode FlowConversionMode { get; }
```